-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Oct 09, 2023 at 08:40 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `laravel`
--

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_reset_tokens_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2023_02_15_140512_create_posts_table', 1);

-- --------------------------------------------------------

--
-- Table structure for table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `posts`
--

CREATE TABLE `posts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `type` varchar(150) NOT NULL,
  `content` text NOT NULL,
  `featured_image` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `posts`
--

INSERT INTO `posts` (`id`, `title`, `type`, `content`, `featured_image`, `created_at`, `updated_at`) VALUES
(10, 'เฟื่องฟ้า', 'ฤดูร้อน', 'ดอกเฟื่องฟ้า เป็นไม้ยืนต้นประเภทพุ่มกึ่งเลื้อย พบมากในเขตร้อนและเขตอบอุ่น ลำต้นมีหนามแหลม ใบเดี่ยว รูปรี สีเขียวหรือใบด่าง ดอกจริงมีขนาดเล็ก สีขาวหรือเหลือง ออกเป็นช่อตามซอกใบหรือปลายกิ่ง ดอกประดับมีขนาดใหญ่ รูปหัวใจหรือรูปไข่ มีหลายสี เช่น ม่วง แดง ชมพู ส้ม ฟ้า เหลือง ออกดอกตลอดทั้งปี\r\nดอกเฟื่องฟ้ามีความหมายว่า ความเบิกบาน สว่างไสว ความรุ่งเรืองที่ก้าวไกลแห่งชีวิต และยังเป็นดอกไม้ประจำราศีพิจิกและราศีกุมภ์', 'images/posts/featured-images/ojUbElNQezLjtNbk9MbOqPI2RVUA6MQFX6O5U4vd.jpg', '2023-10-05 23:28:14', '2023-10-05 23:28:14'),
(11, 'มะลิ', 'ฤดูร้อน', 'ดอกมะลิ เป็นดอกไม้ที่มีลักษณะเป็นดอกเดี่ยวหรือดอกช่อ กลีบดอกมีสีขาวหรือเหลือง ออกดอกตลอดทั้งปี ดอกมะลิมีกลิ่นหอมเย็น นิยมนำมาใช้เพื่อตกแต่ง ร้อยเป็นมาลัยบูชาพระ และทำเครื่องหอม นอกจากนี้มะลิยังเป็นสัญลักษณ์ของวันแม่ด้วยมีสีขาวบริสุทธิ์ ส่งกลิ่นหอมได้ไกลและได้นาน อีกทั้งยังออกดอกได้ตลอดทั้งปี โดยตีความเปรียบกับความรักบริสุทธิ์ของแม่ที่มีต่อลูกไม่เสื่อมคลาย', 'images/posts/featured-images/Yw7V4RvlLFJOBCgkf1JWL9aJe77wR6cVwFrM2DTV.jpg', '2023-10-05 23:32:00', '2023-10-05 23:32:00'),
(12, 'สายหยุด', 'ฤดูร้อน', 'ดอกสายหยุด เป็นดอกไม้ที่มีชื่อวิทยาศาสตร์ว่า Desmos chinensis เป็นไม้เลื้อยหรือไม้รอเลื้อยสูงได้ถึง 4 เมตร ดอกออกเป็นดอกเดี่ยวมีลักษณะคล้ายดอกกระดังงาไทย มีกลีบเล็กยาวดอกละ 5 กลีบ แต่ละกลีบจะบิดงออย่างกะดังงาไทย เมื่ออ่อนเป็นสีเขียว เมื่อแก่จัดจะกลายเป็นสีเหลือง มีกลิ่นหอมแรงโดยเฉพาะตอนเช้า พอถึงยามสายก็หมดกลิ่นหอมไป', 'images/posts/featured-images/yWFldFoj7j7t0bcg7mbTPmluSFabiAlGiWzH2svF.jpg', '2023-10-05 23:40:54', '2023-10-05 23:40:54'),
(13, 'แก้ว', 'ฤดูร้อน', 'ดอกแก้ว เป็นไม้พุ่มขนาดเล็กถึงขนาดกลาง สูงประมาณ 2-5 เมตร ใบออกเป็นช่อเป็นแผงออกใบเรียงสลับกัน ช่อหนึ่งประกอบด้วยใบย่อยประมาณ 4-8 ใบ ใบย่อยเป็นรูปไข่ กว้างประมาณ 2-4 เซนติเมตร ยาวประมาณ 3-7 เซนติเมตร ปลายใบแหลม โคนใบมน ขอบใบเรียบ แผ่นใบสีเขียวเข้ม ดอกสีขาว ออกเป็นช่อกระจะที่ปลายกิ่งหรือตามซอกใบ ช่อดอกยาวประมาณ 10-20 เซนติเมตร ดอกย่อยมีขนาดเล็ก กลีบดอกมี 5 กลีบ เรียงซ้อนเหลื่อมกัน ปลายกลีบมน ดอกมีกลิ่นหอมอ่อนๆ ออกดอกตลอดปี', 'images/posts/featured-images/elgtoIkZb7xp5GwLuypubcImb2pAdyWz4Q27ZTK3.jpg', '2023-10-05 23:48:56', '2023-10-05 23:48:56'),
(14, 'ชมนาด', 'ฤดูร้อน', 'ดอกชมนาด เป็นไม้พุ่มกึ่งเลื้อย ลำต้นเถายาวได้ถึง 8 เมตร ลำต้นมีสีเขียวคล้ำ มีน้ำยางสีขาว ใบเป็นใบเดี่ยวรูปไข่ กว้างประมาณ 3-5 เซนติเมตร ยาวประมาณ 5-7 เซนติเมตร ปลายใบแหลม โคนใบมน ขอบใบเรียบ แผ่นใบสีเขียวเข้ม ดอกออกเป็นช่อกระจุกตามซอกใบและปลายกิ่ง ช่อดอกยาวประมาณ 10-20 เซนติเมตร ดอกย่อยมีขนาดเล็ก กลีบดอกมี 5 กลีบ เรียงซ้อนเหลื่อมกัน ปลายกลีบมน ดอกมีสีขาว เส้นผ่านศูนย์กลางดอกประมาณ 1-2 เซนติเมตร มีกลิ่นหอมคล้ายใบข้าวอ่อนหรือกลิ่นข้าวหอมหุงใหม่ๆ ออกดอกในช่วงเดือน มกราคม-มิถุนายน ดอกดกในช่วงเดือน เมษายน', 'images/posts/featured-images/v8ptAqlZMLG0PFigDqiBGGqDugcwov3E9GjpBMy5.jpg', '2023-10-05 23:54:09', '2023-10-05 23:54:09'),
(15, 'ดาหลา', 'ฤดูร้อน', 'ดาหลา เป็นพืชล้มลุกประเภทใบเลี้ยงเดี่ยวชนิดหนึ่ง ซึ่งมีดอกที่สวยงาม มีความนิยมปลูกเป็นไม้ตัดดอก ที่อยู่ในวงศ์ขิง ซึ่งจัดเป็นพืชที่อยู่ในวงศ์เดียวกันกับขิงและข่า ส่วนลำต้นดาหลาจะอยู่ใต้ดินที่เรียกว่าเหง้าซึ่งเป็นจุดกำเนิดของหน่ออ่อนของต้นดาหลาต่อไป ดอกดาหลาเป็นดอกไม้ที่กินได้ นิยมนำมาประกอบอาหาร เช่น ข้าวยำ แกงเผ็ด แกงส้ม เป็นต้น\r\nดอกดาหลามีสรรพคุณทางยา เช่น แก้ท้องอืด ท้องเสีย แก้ลมพิษ แก้ผดผื่นคัน\r\nเหง้าดาหลามีสรรพคุณทางยา เช่น ขับลม บำรุงธาตุ แก้ท้องอืด ท้องเสีย', 'images/posts/featured-images/ClaLNcvjmrvApU1L2e6vHLFtI8wZGNM2iZUe80LT.jpg', '2023-10-05 23:56:24', '2023-10-05 23:56:24'),
(16, 'สุพรรณิการ์', 'ฤดูร้อน', 'ดอกสุพรรณิการ์ หรือ ดอกซ้อน เป็นดอกไม้ที่สวยงาม มีลักษณะเป็นช่อออกกระจายที่ปลายกิ่ง บานทีละดอก ดอกมีสีเหลืองสดใส กลีบดอกบาง เกสรสีเหลือง รังไข่มีขน ผลกลมเมื่อแก่แตก 3-5 พู ภายในมีเมล็ดรูปไตสีน้ำตาล หุ้มด้วยปุยขาวคล้ายปุยฝ้าย', 'images/posts/featured-images/qnfXp53lfaq9HNI2WrfCBEjNh5hmlfaVUCG8TMvG.jpg', '2023-10-06 00:21:50', '2023-10-06 00:21:50'),
(17, 'ลีลาวดี', 'ฤดูร้อน', 'ดอกลีลาวดี หรือ ลั่นทม เป็นไม้ดอกยืนต้นในวงศ์ตีนเป็ด มีถิ่นกำเนิดในทวีปอเมริกา พบในบริเวณพื้นที่ตั้งแต่ประเทศเม็กซิโกตอนใต้ถึงตอนเหนือของทวีปอเมริกา มีขนาดตั้งแต่พุ่มเตี้ยแคระสูงประมาณ 0.9 - 1.2 เมตร จนถึงต้นที่สูงมาก และบางต้นอาจสูงถึง 12 เมตร ดอกลีลาวดีมีสีสันหลากหลาย สวยงาม ได้แก่ขาว เหลืองอ่อน แดง ชมพู ฯลฯ บางดอกมีมากกว่า 1 สี อาจมีมากถึงหลายสีในดอกเดียว ดอกลีลาวดีเป็นดอกไม้ประจำชาติของประเทศลาว โดยเรียกว่า \"ดอกจำปา\"', 'images/posts/featured-images/F7KACELzjXrcuz8LCs5mB5tNwzSs7a5BM8RltRyM.jpg', '2023-10-06 00:24:11', '2023-10-06 00:24:11'),
(18, 'ชบา', 'ฤดูร้อน', 'ดอกชบาเป็นดอกไม้ที่มีความสวยงาม นิยมปลูกเป็นไม้ประดับทั้งในและต่างประเทศ ดอกชบามีชื่อวิทยาศาสตร์ว่า Hibiscus rosa-sinensis เป็นพืชมีดอกในสกุล Hibiscus วงศ์ Malvaceae เป็นพืชพื้นเมืองในเอเชียตะวันออก ดอกชบามีลักษณะเป็นดอกเดี่ยว มีทั้งดอกซ้อนและดอกชั้นเดียว กลีบดอกมีขนาดใหญ่ มีหลายสีสัน เช่น ขาว แดง แสด เหลือง ม่วง ชมพู และสีอื่น ๆ ดอกชบามีเกสรอยู่ตรงกลางดอก ก้านเกสรเป็นสีแดงหรือสีชมพู ดอกชบาออกดอกตลอดทั้งปี แต่ดอกจะบานสะพรั่งในช่วงฤดูร้อน ดอกชบามีความหมายในเชิงสัญลักษณ์หลายประการ เช่น ความรัก ความงาม ความสง่างาม และความแข็งแกร่ง', 'images/posts/featured-images/qZLcaLpJHr9lITHcmxBRD9YvPiVwdORnpAB0g78r.jpg', '2023-10-06 00:26:33', '2023-10-06 00:26:33'),
(19, 'คุณนายตื่นสาย', 'ฤดูฝน', 'ดอกคุณนายตื่นสาย เป็นไม้ดอกล้มลุก อวบน้ำ อยู่ในวงศ์ผักเบี้ย (Portulacaceae) มีชื่อวิทยาศาสตร์ว่า Portulaca oleracea มีถิ่นกำเนิดในทวีปอเมริกาใต้ ดอกคุณนายตื่นสายเป็นไม้ดอกที่ปลูกง่าย ทนทานต่อสภาพอากาศร้อนและแห้งแล้ง ออกดอกดกและสวยงาม นิยมนำมาปลูกประดับสวนหรือกระถาง ดอกคุณนายตื่นสายยังมีสรรพคุณทางยาอีกด้วย', 'images/posts/featured-images/FqRyIQkC6mwNcAdpuG6modDGmvUckcZxl76NqkBV.jpg', '2023-10-06 00:39:12', '2023-10-06 00:39:12'),
(20, 'ดาวเรือง', 'ฤดูฝน', 'ดอกดาวเรือง เป็นดอกไม้ที่ได้รับความนิยมปลูกกันทั่วโลก ในประเทศไทยเป็นดอกไม้ประจำจังหวัดพิจิตร ดาวเรืองมีถิ่นกำเนิดในประเทศเม็กซิโกและประเทศแถบทวีปอเมริกาใต้ เป็นไม้ล้มลุก มีอายุประมาณ 4-6 เดือน สูงประมาณ 20-60 เซนติเมตร ลำต้นมีสีเขียวเข้ม ใบเป็นใบเดี่ยว ออกเรียงสลับ รูปไข่หรือรูปใบหอก ขอบใบเรียบหรือหยัก ดอกออกเป็นช่อ ออกที่ปลายยอด ดอกมีสีเหลือง สีส้ม หรือสีเหลืองปนส้ม กลีบดอกมี 2 ชั้น ชั้นนอกเป็นกลีบดอกแบบไม่สมบูรณ์เพศ รูปรางน้ำ เรียงซ้อนกันแน่น ชั้นในเป็นกลีบดอกแบบสมบูรณ์เพศ รูปทรงกระบอก ปลายแยกเป็น 5 แฉก เกสรเพศผู้มี 5 อัน รังไข่อยู่ใต้วงกลีบดอก ผลเป็นฝัก รูปไข่ เมล็ดมีสีน้ำตาล', 'images/posts/featured-images/OuNguFtvp2nI7yO7gNi8BC9aberGdJ1Sst0h4ks1.jpg', '2023-10-06 01:03:04', '2023-10-06 01:03:17'),
(21, 'บัวดิน', 'ฤดูฝน', 'ดอกบัวดิน (Zephyranthes) เป็นพืชล้มลุกที่มีหัวอยู่ใต้ดิน ดอกออกเป็นช่อ ดอกย่อยมีขนาดเล็ก กลีบดอกมีรูปร่างคล้ายแตร เรียงซ้อนกันหลายชั้น ดอกบัวดินมีสีสันหลากหลาย เช่น ขาว ชมพู เหลือง แดง ส้ม ม่วง เป็นต้น ดอกบัวดินเป็นดอกไม้ที่นิยมปลูกเป็นไม้ประดับ นิยมปลูกเป็นแปลงประดับสวนหรือปลูกเป็นไม้กระถาง ดอกบัวดินเป็นพืชที่ชอบแดด ดินร่วนซุย ระบายน้ำดี การปลูกดอกบัวดินสามารถทำได้ทั้งการเพาะเมล็ดและแยกหัว', 'images/posts/featured-images/Jyu3yAdcFQF89DQe3WQ2FFm3uVEQDdpWg8qGeqix.jpg', '2023-10-06 01:13:50', '2023-10-06 01:13:50'),
(22, 'ดาวกระจาย', 'ฤดูฝน', 'ดอกดาวกระจาย (Cosmos) เป็นไม้ดอกในวงศ์ทานตะวัน (Asteraceae) มีลักษณะลำต้นตั้งตรง สูงประมาณ 30-100 เซนติเมตร ใบมีลักษณะรูปหอก ขอบใบหยักเว้าลึก ออกดอกเป็นช่อกระจุกบริเวณปลายกิ่ง ดอกมีกลีบดอกรูปขอบขนาน ปลายหยัก 2-3 หยัก กลีบดอกชั้นนอกมีสีสันหลากหลาย เช่น สีขาว ชมพู แดง ส้ม และเหลือง ดอกดาวกระจายเป็นดอกไม้ที่ปลูกง่าย ทนแล้งได้ดี ชอบแสงแดดจัด ออกดอกได้ตั้งแต่ฤดูร้อนจนถึงฤดูหนาว ดอกดาวกระจายมีความหมายในเชิงสัญลักษณ์หลายประการ เช่น ความรัก ความหวัง ความศรัทธา และความงาม นอกจากนี้ ดอกดาวกระจายยังนิยมนำมาทำเป็นดอกไม้แห้งอีกด้วย', 'images/posts/featured-images/vsfitRldP2rCU1Sy5tsNfBcE1rVq3PqE52sCR0gP.jpg', '2023-10-06 01:23:37', '2023-10-06 01:23:37'),
(23, 'บานชื่น', 'ฤดูฝน', 'ดอกบานชื่นเป็นดอกไม้ที่ได้รับความนิยมปลูกประดับกันอย่างแพร่หลาย เพราะเป็นดอกไม้ที่มีสีสันสดใสหลากหลายสี มีทั้งดอกชั้นเดียวและดอกซ้อน ดอกบานชื่นเป็นดอกประเภทดอกรวม (composite flower) ประกอบด้วยดอกย่อยเล็ก ๆ จำนวนมากรวมอยู่บนฐานรองดอก มีก้านชูดอกอันเดียวกันมองดูคล้ายดอกเดี่ยว ดอกบานชื่นมีถิ่นกำเนิดในทวีปอเมริกา พบครั้งแรกในเม็กซิโก ต่อมาแพร่กระจายไปทั่วโลก ดอกบานชื่นเป็นดอกไม้ที่ออกดอกตลอดทั้งปี ชอบแสงแดดจัด ทนต่อสภาพอากาศร้อนได้ดี ขยายพันธุ์ด้วยเมล็ดหรือปักชำ', 'images/posts/featured-images/maxrcO02AsDrg1kX6qdAJ774NOV1X6sOXptYJVl2.jpg', '2023-10-06 01:25:51', '2023-10-06 01:25:51'),
(24, 'เทียนดอก', 'ฤดูฝน', 'ดอกเทียนดอก หรือเทียนบ้าน เป็นไม้ล้มลุก ลำต้นสีเขียวอ่อน อุ้มน้ำ ใบเดี่ยว ขอบใบหยักแบบฟันเลื่อย ก้านใบสั้น มีตุ่มเรียงเป็นแถวยาวทั้งสองด้าน ดอกมีหลายสี ผลรูปไข่ แก่แล้วแตกตามแนวยาว ภายในมีเมล็ดจำนวนมาก สีน้ำตาล ดอกเทียนดอกนิยมนำมาปลูกเป็นไม้ประดับ เพราะมีดอกสวยงาม มีหลากหลายสี ปลูกง่าย โตเร็ว ผลเทียนดอกเมื่อแก่แล้วแตกออกเป็น 5 แฉก ตามรอยแยกดีดเมล็ดออกมา เมล็ดมีลักษณะกลมสีดำน้ำตาล สามารถนำมาใช้เพาะปลูกต่อไปได้', 'images/posts/featured-images/QZbdJuXYYIRABF4JugAY8cQd9A8ZTTtfaGM6oJ4V.jpg', '2023-10-06 01:30:28', '2023-10-06 01:30:28'),
(25, 'พุดซ้อน', 'ฤดูฝน', 'ดอกพุดซ้อน เป็นไม้พุ่มขนาดเล็กถึงขนาดกลาง สูงประมาณ 1-2 เมตร ลำต้นมีสีเทาอมน้ำตาล แตกกิ่งก้านสาขาหนาแน่น ใบมีลักษณะเป็นใบเดี่ยว ออกเรียงตรงข้ามกัน ใบรูปไข่ ปลายใบแหลม โคนใบมน ขอบใบเรียบ แผ่นใบสีเขียวเข้ม ดอกออกเป็นดอกเดี่ยวหรือดอกช่อกระจุก ออกตามง่ามใบและปลายกิ่ง ดอกมีสีขาว กลีบดอกซ้อนกันหลายชั้น กลีบดอกรูปไข่ ปลายกลีบมน ดอกมีกลิ่นหอมแรง ออกดอกตลอดทั้งปี พุดซ้อนเป็นไม้มงคลที่เชื่อว่าหากปลูกไว้ในบ้าน จะทำให้มีความเจริญรุ่งเรือง อุดมสมบูรณ์ สุขภาพแข็งแรง ร่มเย็นเป็นสุข ไม่มีความเดือดเนื้อร้อนใจ คนในบ้านจะอยู่ในศีลธรรมอันดี เพราะคำว่า “พุด” มีความหมายว่า มั่นคง แข็งแรง สมบูรณ์', 'images/posts/featured-images/heVXnzrpiaTpLM50BLwBVfZ52KkbhnRzgeJpu03e.jpg', '2023-10-06 01:35:33', '2023-10-06 01:35:33'),
(26, 'กาสะลอง', 'ฤดูหนาว', 'ดอกปีบ หรือ กาสะลอง เป็นไม้ยืนต้นผลัดใบขนาดกลางถึงใหญ่ เรือนยอดเป็นพุ่มทรงกระบอก มีกิ่งก้านที่ย้อยลง ออกดอกเป็นสีขาวหรือชมพู มีกลิ่นหอม จะออกดอกในช่วงเดือนกันยายน–พฤศจิกายน ดอกปีบมีกลีบดอก 5 กลีบ เรียงซ้อนกันเป็นรูปแตรคว่ำ ปลายกลีบดอกหยักเป็นคลื่น กลีบดอกมีความยาวประมาณ 10-12 เซนติเมตร ดอกตูมมีสีเขียวอ่อน เมื่อบานเต็มที่จะมีสีขาวหรือชมพู ดอกมีกลิ่นหอมอ่อน ๆ ดอกปีบมีสรรพคุณทางยาหลายประการ ดอกปีบแห้งนำมามวนเป็นบุหรี่สูบแก้หอบหืด แก้ริดสีดวงจมูก ไซนัสอักเสบ บำรุงน้ำดี เพิ่มการหลั่งน้ำดี บำรุงโลหิต บำรุงกำลัง แก้ลม ดอกปีบยังนำมาใช้ผสมกับยาไทยเพื่อเพิ่มรสชาติอีกด้วย ดอกปีบเป็นดอกไม้ที่สวยงามและหอมหวาน นิยมปลูกเป็นไม้ประดับตามบ้านเรือนและสวนสาธารณะ ดอกปีบยังเป็นดอกไม้ประจำจังหวัดปราจีนบุรีและมหาวิทยาลัยเทคโนโลยีราชมงคลล้านนาอีกด้วย', 'images/posts/featured-images/8B272UALpYAw1Ngw6NQPNdbBsq0r9sTKa9C80elg.jpg', '2023-10-06 01:41:11', '2023-10-06 01:41:11'),
(27, 'ลำดวน', 'ฤดูหนาว', 'ลำดวน หรือหอมนวล (Lumduan) มีชื่อวิทยาศาสตร์ว่า Melodorum fruticosum Lour. ต้นกำเนิดมาจากประเทศแถบอินโดจีน ในไทยพบมากตามป่าป่าเบญจพรรณหรือป่าดิบแล้ง เป็นทั้งไม้มงคล ต้นประจำจังหวัดศรีสะเกษ และไม้ประดับ ลักษณะเป็นไม้ยืนต้นขนาดกลาง ยอดหนาทึบ ไม่ผลัดใบ เปลือกลำต้นแตกเป็นสะเก็ด ใบเป็นใบเดี่ยว รูปหอก ปลายแหลม โคนมน แผ่นบางเหนียว ส่วนดอกออกเดี่ยว สีเหลืองนวลสวย กลีบหนาแข็ง ส่งกลิ่นหอมเย็นในช่วงเย็นไปจนถึงเช้า มักจะพบในเดือนธันวาคม-มีนาคม ผลทรงกลม อยู่เป็นกลุ่ม สีเขียวเมื่ออ่อน สีแดงอมดำเมื่อสุก นิยมขยายพันธุ์ด้วยการเพาะเมล็ดและตอนกิ่ง ชอบดินร่วน ชอบแดดปานกลาง ชอบน้ำปานกลาง แข็งแรง ทนทาน ทนแล้งดี แต่โตค่อนข้างช้าและใช้เวลานานกว่าจะออกดอก', 'images/posts/featured-images/2VcX9jmMkKeSSDIfnpJ9CwWDn4qsTTRVJLlSbKh6.jpg', '2023-10-06 01:50:37', '2023-10-08 13:39:29'),
(28, 'พะยอม', 'ฤดูหนาว', 'พะยอม (Phayom หรือ White - Meranti) มีชื่อวิทยาศาสตร์ว่า Shorea roxburghii G. Don. ต้นกำเนิดมาจากประเทศในทวีปเอเชีย เช่น ไทย พม่า ศรีลังกา ลักษณะเป็นไม้ยืนต้นขนาดกลางถึงใหญ่ ทรงพุ่มกลมสวยงาม ใบเป็นใบเดี่ยว ขนาดเล็ก รูปหอก ปลายมน โคนมน ขอบเป็นคลื่น เนื้อหนาเป็นมัน ดอกออกเป็นช่อ สีขาวหรือขาวอมเหลือง กลิ่นหอมมาก โดยเฉพาะช่วงเย็นถึงมืด บานพร้อมกันทั้งลำต้น มักจะพบในช่วงปลายฤดูหนาวถึงต้นฤดูร้อน หรือราวเดือนธันวาคม-เมษายน ผลเป็นทรงกระสวยปลายแหลมมีปีก นิยมขยายพันธุ์ด้วยการเพาะเมล็ดและตอนกิ่ง สวยงามแต่โตช้า ปลูกในที่แห้งแล้งได้แต่ไม่ชอบดินเค็ม ช่วงที่ใบร่วงไม่ควรให้ปุ๋ยและน้ำ รอสักพักจนกระทั้งร่วงหมดต้น แล้วจึงกลับมาให้ปุ๋ยและน้ำทันที', 'images/posts/featured-images/ZbXABmUhF7doInrS3rgQG5UbM2KvfJKbVAt9u0NI.jpg', '2023-10-06 02:25:32', '2023-10-06 02:25:32'),
(29, 'กระดังงา', 'ฤดูหนาว', 'กระดังงา หรือการเวก (Ylang-Ylang หรือ Cananga) มีชื่อวิทยาศาสตร์ว่า Artabotrys hexapetalus (Linn.f.) Bhandari. หรือ Cananga odorata (Lamk.) Hook.f. et Th. ต้นกำเนิดมาจากประเทศอินเดียและศรีลังกา ลักษณะเป็นไม้ยืนต้นหรือไม้เลื้อยเนื้อแข็งมีเถา ขนาดกลางถึงใหญ่ อายุหลายปี กิ่งก้านลู่ลงด้านล่าง ใบเป็นใบเดี่ยว รูปรี ปลายแหลม โคนมน แผ่นหนาและเหนียว มีขนตามเส้นใบ ดอกออกเดี่ยว สีเหลืองสวยงาม มีจุดเล็กสีขาวตรงกลาง ส่งกลิ่นหอมแรง บานช่วงเช้าตรู่ พบเห็นได้ตลอดทั้งปี แต่จะดกมากในช่วงเดือนมกราคม-มีนาคม ส่วนผลทรงรีและป้อม มีเมล็ดข้างใน', 'images/posts/featured-images/43tTSFFbMB7xhJUiCLur3YPZzxRfDNKv5sLmQ7XR.jpg', '2023-10-06 02:32:27', '2023-10-06 02:32:27'),
(30, 'วาสนา', 'ฤดูร้อน', 'วาสนา หรือ ประเดหวี (Dracaena) มีชื่อวิทยาศาสตร์ว่า Dracaena fragrans (L.) Ker-GawI. ลักษณะเป็นไม้พุ่มขนาดกลางถึงใหญ่ ลำต้นกลม ไม่มีกิ่งแต่มีข้อติดกัน ใบเป็นใบเดี่ยว รูปหอก โคนเป็นกาบหุ้มต้น ปลายแหลมโค้งลง ขอบเรียบ แผ่นหนา ผิวมัน มีทั้งสีเขียว สีขาวอมเขียว และสีเขียวมีลาย ดอกออกเป็นช่อ สีชมพูอ่อนถึงขาว บานตอนกลางคืน มีกลิ่นหอมแรง มักจะพบในช่วงกลางหรือปลายหนาว ส่วนผลเป็นทรงกลม มีเมล็ดข้างใน ปลูกง่าย ดูแลไม่ยาก ใช้ดินทั่วไป โตเร็วปานกลาง ชอบความชื้นปานกลาง และชอบแสงแดดปานกลางถึงรำไร', 'images/posts/featured-images/VBi4NSgBW4OhBEmpKinwDF1HNRWnxJtYErCDqjYg.jpg', '2023-10-06 02:34:01', '2023-10-06 02:34:01'),
(31, 'ช่อมาลี', 'ฤดูหนาว', 'ช่อมาลี หรือกุมาริกา (Osmanthus) มีชื่อวิทยาศาสตร์ว่า Parameria laevigata (Juss.) Moldenke ต้นกำเนิดมาจากบางประเทศในทวีปเอเชีย ลักษณะเป็นไม้เลื้อยขนาดเล็ก ยึดเกาะได้ดี ลำต้นมีน้ำยางสีขาว ยอดเป็นทรงพุ่มเล็กน้อย ใบเป็นใบเดี่ยว รูปรี ปลายแหลม โคนสอบ ขอบหยัก แผ่นหนา ส่วนดอกออกเป็นช่อ ขนาดเล็ก สีขาว ส่งกลิ่นหอมตอนพลบค่ำ มักจะพบในช่วงฤดูหนาว หรือราวเดือนตุลาคม-กุมภาพันธ์ ผลเป็นฝักคู่และมีเมล็ด นิยมขยายพันธุ์ด้วยการเพาะเมล็ด ปักชำ และตอนกิ่ง โตเร็ว ออกดอกเร็วภายใน 6 เดือน แข็งแรง ทนโรค ทนแมลง ไม่ต้องดูแลมาก ชอบดินร่วน ชอบแสงแดดจัดตลอดวัน ชอบน้ำปานกลาง เหมาะปลูกเป็นไม้ประดับตามแนวรั้ว ปลูกทำซุ้ม แต่ต้องหมั่นกวาดพื้นและทำความสะอาดเพราะใบร่วงเยอะมาก', 'images/posts/featured-images/PdPWTi2uqcyFBv9DGuPrhsIOGcgGVzp5xnnFti83.jpg', '2023-10-06 02:38:25', '2023-10-06 02:38:25'),
(32, 'จันทร์กะพ้อ', 'ฤดูหนาว', 'จันทน์กะพ้อ มีชื่อวิทยาศาสตร์ว่า Vatica diospyroides Syming ต้นกำเนิดมาจากทวีปเอเชียเขตร้อน ลักษณะเป็นไม้ยืนต้นขนาดเล็กถึงใหญ่ ทรงพุ่มโปร่ง ไม่ผลัดใบ กิ่งเปราะง่าบ และมีน้ำยาง ใบเป็นมบเดี่ยว รูปหอก ปลายแหลม โคนเบี้ยวและสอบ ขอบเรียบ แผ่นเกลี้ยงหนา ส่วนดอกออกเป็นช่อสั้น ขนาดเล็ก สีขาวหรือเหลืองอ่อน ส่งกลิ่นหอมแรงหรือหอมร้อน มักจะพบในช่วงเดือนพฤศจิกายน-มีนาคม โดยจะดกมากในเดือนมกราคม-กุมภาพันธ์ ผลทรงกลมรี เป็นขุย สีน้ำตาล นิยมขยายพันธุ์ด้วยการเพาะเมล็ด ชอบดินที่ระบายน้ำดี ชอบที่ร่มมากกว่าที่แจ้ง ชอบร่มเงาจากต้นไม้อื่น ชอบอากาศชื้น และชอบลมไม่แรง ทว่าส่วนใหญ่หายาก ปลูกยาก เพราะราคาแพงและโตช้า ต้องใช้เวลากว่า 5-7 ปี ถึงจะออกดอก', 'images/posts/featured-images/5Fo6dQ2oIHtoDYyLQOOkdoWWxpQkBK2hUHclTgZQ.jpg', '2023-10-06 02:41:22', '2023-10-06 02:41:22'),
(33, 'หิรัญญิการ์', 'ฤดูหนาว', 'หิรัญญิการ์ (Herald Trumpet หรือ Nepal Trumpet) มีชื่อวิทยาศาสตร์ว่า Beaumontia grandiflora Wall. ต้นกำเนิดมาจากประเทศแถบไทย จีน อินเดีย เวียดนาม ลักษณะเป็นไม้เถาเลื้อยเนื้อแข็งขนาดใหญ่ ลำต้นมียางสีขาวและมีขนสีน้ำตาลแดงปกคลุมบางส่วน เลื้อยได้ไกลประมาณ 15 เซนติเมตร กิ่งก้านเป็นพุ่มแน่น ใบเป็นใบเดี่ยว ค่อนข้างใหญ่และยาว ปลายแหลม โคนมน ขอบเรียบ ผิวเกลี้ยง หยาบ และหนา ส่วนดอกออกเป็นช่อ ทรงคล้ายถ้วย ขนาดใหญ่ สีขาวสวย กลิ่นหอมอ่อนช่วงเช้า มักจะพบในช่วงเดือนธันวาคม-เมษายน นิยมขยายพันธุ์ด้วยการตอนกิ่งและเพาะเมล็ด ดูแลง่าย โตได้ในดินเกือบทุกชนิด ชอบอยู่กลางแจ้ง ต้องการแสงมาก ต้องการน้ำปานกลาง ต้องการแค่ปุ๋ยคอกหรือปุ๋ยหมัก ต้องการที่ค้ำให้ยึดเกาะ ไม่ค่อยมีโรคและแมลงรบกวน', 'images/posts/featured-images/51HXvGQtPiqLiNkmiWq1zQqIJ3QH8eLYVVAKQLEW.jpg', '2023-10-06 02:43:39', '2023-10-06 02:43:56'),
(37, 'หอมหมื่นลี้-แก้ไข', 'ฤดูร้อน', 'ต้นหอมหมื่นลี้เป็นพืชในวงศ์มะลิ (Oleaceae) มีชื่อเฉพาะทางวิทยาศาสตร์ว่า Osmanthus Fragrans Lour. มีถิ่นกำเนิดจากพื้นที่บริเวณเทือกเขาหิมาลัย และประเทศจีน ต่อมาได้มีการกระจายสายพันธุ์ไปทางใต้ของประเทศญี่ปุ่นและประเทศอื่น ๆ ในภูมิภาคทวีปเอเชียตะวันออกเฉียงใต้อีกหลายประเทศ รวมถึงประเทศไทยด้วย', 'images/posts/featured-images/sb393EKg41CliyZg1g1yR1CmdPbpXjvPTzaddeyM.jpg', '2023-10-08 23:15:05', '2023-10-08 23:15:31');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'Admin', 'rthit096@gmail.com', NULL, '$2y$10$rZNbUI74oHfW.Lozr057vOl6AP1VBGMLlLklpnJ8YAVhUKQjEDwYK', NULL, '2023-10-05 03:29:58', '2023-10-05 03:29:58');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `posts`
--
ALTER TABLE `posts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
